#include <stdlib.h>
#define _USE_MATH_DEFINES
#include <math.h>
#include <cmath>
#include <stdio.h>
#include <iostream>
int main()
{
	float AijT[2][2];//транспонированна€ матрица алгебраических дополнений
	float e = 0.001;

	float lAl;//определитель
	float A_1[2][2];//обратна€ матрица
	// матрицы корней (x, y) прошлой и насто€щей итерации
	float X2[2] = { 1,1 };
	float X1[2] = { 2,2 };
	float f[2];

	printf("ћетод Ќьютона\n");
	//ћетод Ќьютона
	while (fabs(X2[0] - X1[0]) >= e || fabs(X2[1] - X1[1]) >= e)
	{
		//итераци€
		X1[0] = X2[0];
		X1[1] = X2[1];

		//вычисление обратной матрицы
		AijT[0][0] = -sin(X1[0] - 1) + 1;
		AijT[0][1] = -2;
		AijT[1][0] = -1;
		AijT[1][1] = cos(X1[1]);

		lAl = cos(X1[0]) * (-sin(X1[1] - 1) + 1) - 2;

		A_1[0][0] = AijT[0][0] * 1 / lAl;
		A_1[0][1] = AijT[0][1] * 1 / lAl;
		A_1[1][0] = AijT[1][0] * 1 / lAl;
		A_1[1][1] = AijT[1][1] * 1 / lAl;

		//вычисление Xi
		f[0] = sin(X1[0]) + 2 * X1[1] - 1.6;
		f[1] = X1[0] + cos(X1[1] - 1) - 1;

		X2[0] = X1[0] - (A_1[0][0] * f[0] + A_1[0][1] * f[1]);
		X2[1] = X1[1] - (A_1[1][0] * f[0] + A_1[1][1] * f[1]);
	}
	printf("x = %f\ny = %f\n\n", X1[0], X1[1]);
	//ћетод итераций
	X1[0] = 2;//Ќулевое приближение
	X1[1] = 2;
	X2[0] = 0;
	X2[1] = 1;
	printf("ћетод итераций\n");
	while (fabs(X1[0] - X2[0]) >= e or fabs(X1[1] - X2[1]) >= e)
	{
		//»тераци€
		X1[0] = X2[0];
		X1[1] = X2[1];
		//вычисление очередного значени€

		X2[0] = 1 - cos(X1[1] - 1);
		X2[1] = 0.8 - sin(X1[0]) * 0.5;
	}
	printf("x = %f\ny = %f\n", X1[0], X1[1]);
}